; R2Single 多国语言配置文件
; 本文件向下兼容，高版本配置文件可用于低版本启动器
; v1.44.606

[Default]
lang=0004,7C04,0009,000A,0011,0012
rel=0009
font=Tahoma,8,0

;;; 语言无关 language independent
;bgclr=&HC599FF

; 程序常量
F0000010=R2Tool.exe

; 控制启动器的频道难度上限,必须与gfis保持一致,若要修改,这里和gfis两边都要改,否则NPC模式会出意外
F0000310=4	;新手频道难度上限
F0000312=7	;星星频道难度上限
F0000313=13	;月亮频道难度上限
		;太阳频道难度没有上限

; 控制界面显示,1=显示,0=隐藏
;F1050102=1	;打开单机工具按钮
;F1050104=1	;刷新歌曲列表按钮

; F1040301-1F共31个位置皆为自定义节奏点文件名,最长14字节,不需连号,节奏点统一放入rnr_game/image目录中
; 对应的显示名在下面的01040301-1F定义
F1040301=tlight_2.tga
F1040302=tlight_3.tga
F1040303=tlight_5.tga
F1040304=tlight_5_1.tga
F1040305=tlight_5_2.tga
F1040306=tlight_5_3.tga
F1040307=tlight_6.tga
F1040308=tlight_6_1.tga
F1040309=tlight_6_2.tga
F104030A=tlight_6_3.tga
F104030B=tlight_kim.tga


[0004]
; Chinese
; No translator needed
font=SimSun,9,134
00000000="Chinese Simplified"
00000001="简体中文"

;;;;;;主界面
01000001=81's Home (版本 {1})
01000101=lang/logo.jpg
01000201=lang/R2Beat.ico

01010000=画面设置
01010101=800 x 600
01010102=1024 x 768
01010103=窗口化
01010104=描边

01020000=角色属性
01020101=角色名:
01020102=选人物:
01020103=经验值:
01020104=金币:
01020105=Q点:
01020300=自己建立
01020301=普通男
01020302=普通女

01030000=功能设置
01030001=模式设置
01030002=键位设置
01030003=选歌设置
01030004=变速设置
01030005=NPC设置
0103000F=其他设置
01030101=不回房间固定
01030102=F1.自动加速
01030103=F2.无限加速
01030104=F9.打开判定计算器
01030105=自动游戏
01030106=打开快捷键
01030107=随机选歌
01030108=不回房间随机
01030109=开启右Ctrl加速
0103010A=退出时清理垃圾文件
01030111=修改速度
01030112=镜子模式
01030113=泰坦模式
01030120=开启变速
01030121=复位
01030122={1} 倍
01030130=NPC水平跟随玩家
010302E0=右手键位(方向键)
010302E1=左手键位(WASD)
010302F0=和
010302F1=或
01030300=新手歌({1})
01030301=星星歌({1})
01030302=月亮歌({1})
01030303=太阳歌({1})
01030304=新歌({1})
01030310=新手歌({1})
01030312=星星歌({1})
01030313=月亮歌({1})
01030314=满月歌({1})
01030316=太阳歌({1})
01030320=新歌({1})
01030401=普通
01030402=高速
01030403=超高速
01030404=飞速
01030405=极速

01040000=节奏点设置
01040101=一般
01040108=判定模式
01040300=正常
01040301=粉红心
01040302=钻石星
01040303=金花
01040304=冷翠花
01040305=蔚蓝花
01040306=红花
01040307=金星
01040308=冷翠星
01040309=蔚蓝星
0104030A=红星
0104030B=金馆长

01050101=启动游戏
01050102=打开单机工具
01050103=重新载入数据
01050104=刷新歌曲列表
0105010F=更多设置
01050110=游戏版本
01050111=兼容模式

01060000=语言设置

;;;;;;判定计算器
02000001=判定

02010000=判定计算{1}
02010101=时间:
02010102=连续99%:
02010103=位置:
02010104=在第{1}combo
02010105=判定模式开启
02010106=本次游戏您一共卡了###次
02010107=本次游戏您一共卡了{1}次
02010108=自动游戏
02010109=变速
02010111=速度模式开启
02010112=镜子模式开启
02010113=泰坦模式开启

;;;;;;弹出对话框
0F000001=请关闭其它的单机启动程序,否则会造成冲突!
0F000002=使用FSO组件建立文件失败,请检查系统完整性!
0F000003=名字长度不能超过12字节!
0F000004=打开 {1} 失败!
0F000005=加载文件 rnr_script/music.txt 失败!
0F000006=确定要重新扫描歌曲列表吗?
0F000007=请打开控制面板->区域与语言选项->高级,安装54936-GB18030代码页,否则无法正常游戏!
0F000008=Winsock 初始化失败,这说明系统被破坏,请修复Winsock LSP!
0F000009=启动游戏失败!
0F00000A=Locale {1} 无效。请打开mghack.cfg文件，删除[EXE]下的Locale项。
0F00000B=写入文件失败！请检查游戏目录的权限，设置成Everyone可写！
0F00000C=加载文件 {1} 失败!
0F00000D=名字不能与NPC重复!
;0F00000E=请不要在AppLocale下面运行，否则会出现乱码!
;0F00000F=检测到 rnr_script/music.txt 里面有重号！ID={1}


[7C04]
; Chinese
; No translator needed
font=PMingLiU,9,136
00000000="Chinese Traditional"
00000001="繁體中文"

;;;;;;主介面
01000001=81's Home (版本 {1})

01010000=畫面設置
01010101=800 x 600
01010102=1024 x 768
01010103=窗口化
01010104=描邊

01020000=角色屬性
01020101=角色名:
01020102=選人物:
01020103=經驗值:
01020104=金幣:
01020105=Q點:
01020300=自己建立
01020301=普通男
01020302=普通女

01030000=功能設置
01030001=模式設置
01030002=鍵位設置
01030003=選歌設置
01030004=變速設置
01030005=NPC設置
0103000F=其他設置
01030101=不回房間固定
01030102=F1.自動加速
01030103=F2.無限加速
01030104=F9.打開判定計算器
01030105=自動遊戲
01030106=打開快捷鍵
01030107=隨機選歌
01030108=不回房間隨機
01030109=開啟右Ctrl加速
0103010A=退出時清理垃圾檔案
01030111=修改速度
01030112=鏡子模式
01030113=泰坦模式
01030120=開啟變速
01030121=復位
01030122={1} 倍
01030130=NPC水平跟隨玩家
010302E0=右手鍵位(方向鍵)
010302E1=左手鍵位(WASD)
010302F0=和
010302F1=或
01030300=新手歌({1})
01030301=星星歌({1})
01030302=月亮歌({1})
01030303=太陽歌({1})
01030304=新歌({1})
01030310=新手歌({1})
01030312=星星歌({1})
01030313=月亮歌({1})
01030314=滿月歌({1})
01030316=太陽歌({1})
01030320=新歌({1})

01040000=節奏點設置
01040101=一般
01040108=判定模式
01040300=正常
01040301=粉紅心
01040302=鑽石星
01040303=金花
01040304=冷翠花
01040305=蔚藍花
01040306=紅花
01040307=金星
01040308=冷翠星
01040309=蔚藍星
0104030A=紅星
0104030B=金館長

01050101=啟動遊戲
01050102=打開單機工具
01050103=重新載入數據
01050104=刷新歌曲列表
0105010F=更多設置
01050110=遊戲版本
01050111=兼容模式

01060000=語言設置

;;;;;;判定计算器
02000001=判定

02010000=判定計算{1}
02010101=時間:
02010102=連續99%:
02010103=位置:
02010104=在第{1}combo
02010105=判定模式開啟
02010106=本次遊戲您一共卡了###次
02010107=本次遊戲您一共卡了{1}次
02010108=自動遊戲
02010109=變速
02010111=速度模式開啟
02010112=鏡子模式開啟
02010113=泰坦模式開啟

;;;;;;弹出对话框
0F000001=請關閉其他的單機啟動程式,否則會造成衝突!
0F000002=使用FSO元件建立檔案失敗,請檢查系統完整性!
0F000003=名字長度不能超過12位元組!
0F000004=打開 {1} 失敗!
0F000005=載入檔案 rnr_script/music.txt 失敗!
0F000006=确定要重新扫描歌曲列表吗?
0F000007=請打開控制面板->區域與語言選項->高級,安裝54936-GB18030代碼頁,否則無法正常游戲!
0F000008=Winsock 初始化失敗,這說明系統被破壞,請修復Winsock LSP!
0F000009=啟動遊戲失敗!
0F00000A=Locale {1} 無效。請打開mghack.cfg檔案，删除[EXE]下的Locale项。
0F00000B=寫入檔案失敗！請檢查遊戲目錄的權限，設置成Everyone可寫！
0F00000C=載入檔案 {1} 失敗!
0F00000D=名字不能与NPC重複!


[0404]
rel=7C04
[0804]
rel=0004
[0C04]
rel=0404
[1004]
rel=0804
[1404]
rel=0C04
[7804]
rel=0004


[0009]
; English
; No translator needed
00000000="English"
00000001="English"

;;;;;;主界面
01000001=81's Home (Ver {1})

01010000=Graphic Config
01010101=800 x 600
01010102=1024 x 768
01010103=Window
01010104=Outline

01020000=Role Config
01020101=Name:
01020102=Role:
01020103=Exp.:
01020104=Coin:
01020105=Cash:
01020300=Undefined
01020301=Normal Boy
01020302=Normal Girl

01030000=Function Config
01030001=Mode Config
01030002=Key Config
01030003=Music Config
01030004=Speed Gear Config
01030005=NPC Config
0103000F=Other Config
01030101=Lock Music
01030102=F1.Auto Booster
01030103=F2.Infinite Booster
01030104=F9.Open Accu. Calc
01030105=Auto Play (Demo)
01030106=Enable Hotkeys
01030107=Random Music
01030108=Lock Random
01030109=Enable RightCtrl Boost
0103010A=Clean up log files at exit
01030111=Edit Speed
01030112=Mirror Mode
01030113=Titan Mode
01030120=Enable Speed Gear
01030121=Reset
01030122={1}x
01030130=NPC level follows player
010302E0=Right Hand(Directions)
010302E1=Left Hand (WASD)
010302F0=And
010302F1=Or
01030300=Rookie({1})
01030301=Star({1})
01030302=Moon({1})
01030303=Sun({1})
01030304=New({1})
01030310=Rookie({1})
01030312=Star({1})
01030313=Moon({1})
01030314=Full Moon({1})
01030316=Sun({1})
01030320=New({1})

01040000=Point Config
01040101=General
01040108=Hide Mode
01040300=Normal
01040301=Pink Heart
01040302=Diamond Star
01040303=Golden Flower
01040304=Emerald Flower
01040305=Blue Flower
01040306=Red Flower
01040307=Golden Star
01040308=Emerald Star
01040309=Blue Star
0104030A=Red Star
0104030B=Mr. Kim

01050101=Start Game
01050102=Open R2Single Tool
01050103=Reload Data
01050104=Refresh Music List
0105010F=More Settings
01050110=Game Version
01050111=Compatibility Mode

01060000=Language

;;;;;;判定计算器
02000001=Accuracy

02010000=Accu. Calc {1}
02010101=Time:
02010102=Cont99%:
02010103=Position:
02010104=At combo {1}
02010105=Hide Mode On
02010106=You stuck ### times
02010107=You stuck {1} times
02010108=Autoplay
02010109=NtGear
02010111=Speed Mode On
02010112=Mirror Mode On
02010113=Titan Mode On

;;;;;;弹出对话框
0F000001=Please close other r2single programs to prevent conflicting.
0F000002=Error creating File System Object. Please check your system.
0F000003=The length of name cannot be more than 12 bytes!
0F000004=Failed to open {1}!
0F000005=Error Loading File rnr_script/music.txt !
0F000006=Are you sure to rebuild music list?
0F000007=Please open Control Panel -> Region and Language Options -> Advanced, and install codepage 54936-GB18030, otherwise you will experience lots of problems!
0F000008=Winsock initialisation failed! It indicates that your system is broken. Please repair Winsock LSP chain!
0F000009=Start Game failed!
0F00000A=Invalid locale {1}. Please open file mghack.cfg and delete the item "Locale" under [EXE] section.
0F00000B=Failed to write to file! Please check the permissions of the game folder and set to everyone can write.
0F00000C=Error Loading File {1} !
0F00000D=The nickname must be distinct from NPC!



[000A]
; Spanish
; Translator=Linda
00000000="Spanish"
00000001="Español"

;;;;;;主界面
01000001=81's Home (Ver {1})

01010000=Config gráfica
01010101=800 x 600
01010102=1024 x 768
01010103=Ventana
01010104=Contorno

01020000=Configuración de papel
01020101=Nombre:
01020102=Papel:
01020103=Exp.:
01020104=Rcoin:
01020105=Cash:
01020300=Indefinido
01020301=Niño normal
01020302=Niña normal

01030000=Configuración de la función
01030001=Configuración del modo
01030002=Configuración de teclas
01030003=Config de la musica
01030004=Configuración de engranajes de velocidad
01030005=Configuración de NPC
0103000F=Otras configuraciones
01030101=Bloquear música
01030102=F1.Impulsar auto.
01030103=F2.Impulsar infinita
01030104=F9.Abrir l'calc d'prec
01030105=Jugar automática
01030106=Permitir teclas rpd.
01030107=Barajar música
01030108=Bloquear baraja
01030109=Ctrl dcha a impulsa
0103010A=Eliminar archivos de registro al salir
01030111=Cambiar la velocidad
01030112=Modo espejo
01030113=Modo locura
01030120=Permitir a eng. de velo.
01030121=Reiniciar
01030122={1}x
01030130=El nivel de NPC sigue al jugador
010302E0=Derecha (direcciónes)
010302E1=Izquierda (WASD)
010302F0=y
010302F1=o
01030300=Novato({1})
01030301=Estrella({1})
01030302=Luna({1})
01030303=Sol({1})
01030304=Nuevo({1})
01030310=Novato({1})
01030312=Estrella({1})
01030313=Luna({1})
01030314=Luna llena({1})
01030316=Sol({1})
01030320=Nuevo({1})

01040000=Config piedras
01040101=General
01040108=Sin piedras
01040300=Normal
01040301=Corazón rosa
01040302=Estrella de diamante
01040303=Flor dorada
01040304=Flor esmeralda
01040305=Flor azul
01040306=Flor roja
01040307=Estrella dorada
01040308=Estrella esmeralda
01040309=Estrella azul
0104030A=Estrella roja
0104030B=El señor Kim

01050101=Iniciar juego
01050102=Abrir herramienta R2Single
01050103=Recargar los datos
01050104=Actualizar la lista de música
0105010F=Más configuraciones
01050110=Versión del juego
01050111=Modo de compatibilidad

01060000=Lengua

;;;;;;判定计算器
02000001=Precisión

02010000=Calc de prec {1}
02010101=Tiempo:
02010102=Cont99%:
02010103=Posición:
02010104=en combo {1}
02010105=Sin piedras on
02010106=Usted atascado ### veces
02010107=Usted atascado {1} veces
02010108=Automática
02010109=NtGear
02010111=Modo d'velo On
02010112=Modo espejo on
02010113=Modo locura

;;;;;;弹出对话框
0F000001=Por favor, cierre otros programas r2single para evitar conflicto.
0F000002=Error al crear el sistema de archivos de objetos. Por favor verifique su sistema.
0F000003=¡La longitud del nombre no puede contener más de 12 bytes!
0F000004=¡No se pudo abrir {1}!
0F000005=¡Error al cargar el archivo rnr_script/music.txt !
0F000006=¿Seguro que reconstruir la lista de la música?
0F000007=Por favor, abra el Panel de control -> Región y de idioma -> Opciones avanzadas, e instalar la página de códigos GB18030-54936, ¡de lo contrario usted experimentará muchos problemas!
0F000008=¡Inicialización de Winsock Error! Indica que el sistema está roto. ¡Repare cadena Winsock LSP!
0F000009=¡Iniciar juego falló!
0F00000A=Locale {1} no válido. Por favor, abra archivo mghack.cfg y eliminar el elemento "Locale" bajo [EXE] sección.
0F00000B=¡Error al escribir en el archivo! Por favor, compruebe los permisos de la carpeta del juego y se puso a everyone puede escribir.
0F00000C=¡Error al cargar el archivo {1} !
0F00000D=¡El nombre debe ser distinto de NPC!


[0011]
; Japanese
; Translator=R2FAN, Linda
font=MS UI Gothic,9,128
00000000="Japanese"
00000001="日本語"

;;;;;;主界面
01000001=81's Home (版本 {1})

01010000=画面設定
01010101=800 x 600
01010102=1024 x 768
01010103=ウィンドウ
01010104=ふちどり

01020000=プレイヤー設定
01020101=お名前:
01020102=アバター:
01020103=経験値:
01020104=コイン:
01020105=Q点:
01020300=キャラ作成
01020301=デフォルト♂
01020302=デフォルト♀

01030000=オプション
01030001=モード設定
01030002=キー設定
01030003=音楽選択の設定
01030004=変速機の設定
01030005=NPCの設定
0103000F=その他の設定
01030101=戻らず固定
01030102=F1.オートブースト
01030103=F2.無限ブースト
01030104=F9.判定計算機
01030105=オートプレイ
01030106=ホットキーを使用
01030107=曲ランダム
01030108=戻らずランダム
01030109=右Ctrlでブーストする
0103010A=終了時にログファイルを削除する
01030111=Speed Mode
01030112=鏡像モード
01030113=Titan Mode
01030120=変速機を使用
01030121=リセット
01030122={1}x
01030130=NPCレベルはプレイヤーに従う
010302E0=右手 (方向キー)
010302E1=左手 (WASD)
010302F0=と
010302F1=か
01030300=Rookie曲({1})
01030301=星曲({1})
01030302=月曲({1})
01030303=太陽曲({1})
01030304=新曲({1})
01030310=Rookie曲({1})
01030312=星曲({1})
01030313=月曲({1})
01030314=満月曲({1})
01030316=太陽曲({1})
01030320=新曲({1})

01040000=リズムボール設定
01040101=通常モード
01040108=透過モード
01040300=デフォルト
01040301=薄紅の心
01040302=ダイヤの星
01040303=黄金の花
01040304=緑の花
01040305=青い花
01040306=赤い花
01040307=黄金の星
01040308=緑の星
01040309=青い星
0104030A=赤い星
0104030B=金館長

01050101=スタート
01050102=ツール起動
01050103=データ更新
01050104=曲リスト更新
0105010F=その他の設定
01050110=ゲームバージョン
01050111=互換モード

01060000=言語設定

;;;;;;判定计算器
02000001=判定

02010000=判定計算{1}
02010101=時間:
02010102=連続99%:
02010103=位置:
02010104={1}位Comboで
02010105=透過モード起動
02010106=このGameを###次の切です
02010107=このGameを{1}次の切です
02010108=自動Play
02010109=変速
02010111=Speed Mode起動
02010112=Mirror Mode起動
02010113=Titan Mode起動

;;;;;;弹出对话框
0F000001=複数起動しています。他のR2Beatを閉じて下さい。
0F000002=エラーによりファイルシステムオブジェクトが生成されました。システムを確認して下さい。
0F000003=12バイト以上の名前をつけることは出来ません。
0F000004={1}を開くことが出来ませんでした。
0F000005=rnr_script/music.txtの読み込みに失敗しました。
0F000006=ミュージックリストを生成し直しますか?
0F000007=コントロール パネル->地域と言語のオプション->詳細設定を開いて、コード ページ 54936-GB18030をインストールして下さい。そうでなければ、ゲームをプレイすることは出来ません。
0F000008=Winsockの初期化に失敗しました！それはあなたのシステムが壊れていることを示しています。WinsockのLSPチェーンを修復してください！
0F000009=ゲームスタートに失敗しました！
0F00000A=Locale {1}は無効です。ファイルmghack.cfgを開き、[EXE]セクションの「Locale」項目を削除してください。
0F00000B=ファイルを書き込めに失敗しました！ゲームフォルダの権限を確認し、everyoneが書き込むことができるように設定してください。
0F00000C={1}の読み込みに失敗しました。
0F00000D=名前はNPCと同じでは行けません。

[0012]
; Korean
; Translator=[AG.M]Brain, Linda
font=Dotum,9,129
00000000="Korean"
00000001="한국어"

;;;;;;主界面
01000001=81's Home (Ver {1})

01010000=화면설정
01010101=800 x 600
01010102=1024 x 768
01010103=창모드
01010104=외곽선

01020000=캐릭터설정
01020101=닉네임:
01020102=캐릭터:
01020103=알포인트
01020104=알코인:
01020105=알캐쉬:
01020300=자기설립하다
01020301=남자
01020302=여자

01030000=기능설정
01030001=모드설정
01030002=키 설정
01030003=음악설정
01030004=변속기설정
01030005=NPC설정
0103000F=가타설정
01030101=음악 반복
01030102=F1.자동 부스터
01030103=F2.무한 부스터
01030104=F9.판정 계산
01030105=자동 연주
01030106=단축키 열기
01030107=무작위로음악
01030108=무작위로반복
01030109=오른쪽Ctrl키 부스터
0103010A=종료 할 때 로그 파일을 삭제
01030111=속도모드
01030112=거울모드
01030113=좌절방지
01030120=변속기 열기
01030121=재설정
01030122={1} 배
01030130=NPC레벨이 플레이어를 따르다
010302E0=오른손 (방항 키)
010302E1=왼손 (WASD)
010302F0=와
010302F1=혹은
01030300=새내기({1})
01030301=별곡({1})
01030302=달곡({1})
01030303=해곡({1})
01030304=신곡({1})
01030310=새내기({1})
01030312=별곡({1})
01030313=달곡({1})
01030314=보름달({1})
01030316=해곡({1})
01030320=신곡({1})

01040000=스톤설정
01040101=보통 모드
01040108=노스톤모드
01040300=정상이다
01040301=핑크 꽃
01040302=다이아몬드 별
01040303=황금의 꽃
01040304=녹색 꽃
01040305=푸른 꽃
01040306=붉은 꽃
01040307=황금의 별
01040308=녹색 별
01040309=푸른 별
0104030A=붉은 별
0104030B=김관장

01050101=게임시작
01050102=싱글알투비트 도구 열다
01050103=게임정보 다시 읽기
01050104=새로 고침 음악 목록
0105010F=추가 설정
01050110=게임 버전
01050111=호환 모드

01060000=언어설정

;;;;;;判定计算器
02000001=판정

02010000=판정계산{1}
02010101=시간:
02010102=연속99%:
02010103=위치:
02010104=제{1}콤보로
02010105=노스톤모드On
02010106=너는 ###번 걸렸다
02010107=너는 {1}번 걸렸다
02010108=자동단련
02010109=변속
02010111=속도모드On
02010112=거울모드On
02010113=좌절방지On

;;;;;;弹出对话框
0F000001=제발 주문 충돌을 피하기 위해, 다른 시작하는 프로그램을 닫습니다.
0F000002=FSO를 사용하여 파일을 창설하지 실패했다. 시스템 무경성을 확인해주세요.
0F000003=닉네임 길이는 최대 12바이트 입니다.
0F000004=파일 {1} 열기에 실패했습니다.
0F000005=파일 rnr_script/music.txt 이 로드에 실패했습니다.
0F000006=당신은 음악 목록을 새로 하시겠습니까?
0F000007=제어판 -> 지역 및 언어 옵션 -> 고급 을 열고 코드 페이지 54936-GB18030을 설치하십시오. 그렇지 않으면 많은 문제가 발생합니다!
0F000008=Winsock을 초기화에 실패했습니다! 그것은 당신의 시스템이 분해되어 있음을 알 수 있었다. Winsock LSP chain을 수리하세요!
0F000009=게임 시작 실패!
0F00000A=로케일 {1} 이 잘못되었습니다. Mghack.cfg 파일을 열고 [EXE] 섹션에서 "Locale"항목을 삭제하십시오.
0F00000B=파일을 쓰지 못했습니다! 게임 폴더의 사용 권한을 확인하고 everyone이 쓸 수 있도록 설정하십시오.
0F00000C=파일 {1} 이 로드에 실패했습니다.
0F00000D=닉네임은 NPC와 같을 수 없습니다!

